<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=iso-8859-1">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice 4.1.0  (Unix)">
	<META NAME="AUTHOR" CONTENT="Mihai Calciu">
	<META NAME="CREATED" CONTENT="20140514;18002100">
	<META NAME="CHANGEDBY" CONTENT="Mihai Calciu">
	<META NAME="CHANGED" CONTENT="20140514;19222700">
	<STYLE TYPE="text/css">
	<!--
		@page { margin: 2cm }
		P { margin-bottom: 0.21cm }
		H1 { margin-bottom: 0.21cm }
		H1.western { font-family: "Times New Roman", serif }
		H1.cjk { font-family: "SimSun" }
		H1.ctl { font-family: "Lucida Sans" }
		H4 { margin-bottom: 0.21cm }
		H4.cjk { font-family: "SimSun" }
		H4.ctl { font-family: "Lucida Sans" }
		H3 { margin-bottom: 0.21cm }
		H3.cjk { font-family: "SimSun" }
		H3.ctl { font-family: "Lucida Sans" }
		H2 { margin-bottom: 0.21cm }
		H2.cjk { font-family: "SimSun" }
		H2.ctl { font-family: "Lucida Sans" }
		H6 { margin-bottom: 0.21cm }
		H6.western { font-family: "Arial", sans-serif; font-size: 10pt }
		H6.cjk { font-family: "SimSun"; font-size: 10pt }
		H6.ctl { font-family: "Lucida Sans"; font-size: 10pt }
		A:link { so-language: zxx }
	-->
	</STYLE>
</HEAD>
<BODY LANG="fr-FR" DIR="LTR">
<H1 CLASS="western"><A NAME="Recherche_Marketing:_Collecte_et_Analyse_des_donn.C3.A9es"></A>
Recherche Marketing: Collecte et Analyse des donn&eacute;es 
</H1>
<H4 CLASS="western"><A NAME="Michel_Calciu"></A>Michel Calciu 
</H4>
<H3 CLASS="western"><A NAME="Cours_.C3.A0_l.27Universit.C3.A9_de_Lille_1_-_2013.2F2014"></A>
Cours &agrave; l'Universit&eacute; de Lille 1 - 2013/2014 
</H3>
<H2 CLASS="western"><A NAME="Introduction"></A>Introduction 
</H2>
<H6 CLASS="western"><A NAME="Le_concept_du_marketing"></A>Le concept
du marketing 
</H6>
<P>Dans l'&eacute;poque actuelle o&ugrave; le savoir produire ne
suffit plus pour assurer la place d'une entreprise ou d'un produit
sur le march&eacute; &agrave; cause d'un environnement tr&egrave;s
concurrentiel, l'approche marketing semble offrir la cl&eacute; du
succ&egrave;s. 
</P>
<P><I>L'id&eacute;e centrale du marketing est la concentration sur le
consommateur( ou le client) et l'adaptation &agrave; ses attentes</I>.
Le marketing c'est un <I>&eacute;tat d'esprit</I>, c'est un <I>art</I>,
mais c'est aussi une <I>science</I>. Traditionnellement on fait la
distinction entre deux phases du marketing, la <I>phase analytique</I>
ou la recherche marketing (Marketing Research) et la <I>phase
op&eacute;rationnelle</I> qui regroupe le marketing op&eacute;rationnel
et strat&eacute;gique. 
</P>
<H6 CLASS="western"><A NAME="Le_r.C3.B4le_de_la_recherche_marketing"></A>
Le r&ocirc;le de la recherche marketing 
</H6>
<P>La <I>recherche marketing</I> d&eacute;veloppe un ensemble de
techniques pour l'&eacute;tude du consommateur, de la client&egrave;le
et du march&eacute;. Elle d&eacute;tecte et enregistre les besoins et
motivations des clients, qu'elle d&eacute;duit souvent &agrave;
partir des attitudes exprim&eacute;es ou des comportements observ&eacute;s.
Elle dispose de tout un arsenal coh&eacute;rent de m&eacute;thodes
pour arriver &agrave; &eacute;valuer les march&eacute;s et leurs
attentes, pour identifier la perception (positionnement) des produits
et des services par rapport aux attentes et aux concurrents, pour
segmenter la client&egrave;le afin d'isoler et cibler les groupes que
l'entreprise avec ses moyens et ses comp&eacute;tences peut le mieux
servir. 
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><A HREF="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/index.php/File:Image417.gif"><FONT COLOR="#000080"><IMG SRC="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/images/9/90/Image417.gif" NAME="graphics1" ALT="Image417.gif" ALIGN=BOTTOM WIDTH=402 HEIGHT=394 BORDER=2></FONT></A></P>
<P ALIGN=CENTER><BR><BR>
</P>
<P ALIGN=CENTER STYLE="margin-top: 0.22cm; margin-bottom: 0.21cm; widows: 2; page-break-before: auto; page-break-after: auto">
<FONT FACE="Arial, sans-serif"><FONT SIZE=2 STYLE="font-size: 10pt"><B>Figure
1. Le marketing et le consommateur. </B></FONT></FONT>
</P>
<P>Le marketing op&eacute;rationnel et le marketing strat&eacute;gique
utilisent les informations fournies par la recherche marketing pour
d&eacute;velopper et appliquer une politique de produit, de prix, de
communication et de distribution adapt&eacute;e aux attentes de la
client&egrave;le cibl&eacute;e. 
</P>
<H6 CLASS="western"><A NAME="Objectifs_du_cours"></A>Objectifs du
cours 
</H6>
<P>L'objectif de ce cours est de pr&eacute;senter les <I>techniques
de recueil, traitement et analyse des donn&eacute;es</I> int&eacute;gr&eacute;es
au <I>cadre conceptuel de la recherche marketing</I>. Ces techniques
sont illustr&eacute;es par de nombreux <I>exemples et &eacute;tudes
de cas</I>. La solution de la plupart des traitements des donn&eacute;es
qu'elles impliquent est pr&eacute;sent&eacute;e sur <I>tableur</I>
(Excel), qui est l'instrument microinformatique le plus utilis&eacute;
dans les entreprises. Un <I>logiciel d'analyse des donn&eacute;es</I>
multidimensionnelles &eacute;crit par l'auteur est mis &agrave;
disposition. Il int&egrave;gre sur le tableur les m&eacute;thodes
d'analyse multivari&eacute;e les plus importantes pour la pratique de
la recherche marketing. 
</P>
<H6 CLASS="western"><A NAME="La_typologie_des_.C3.A9tudes_de_march.C3.A9"></A>
La typologie des &eacute;tudes de march&eacute; 
</H6>
<P>Toute recherche commence par une phase <B>exploratoire</B>. Les
entretiens individuels et/ou de groupe sont des moyens de d&eacute;couverte
de la probl&eacute;matique du march&eacute; (ou domaine) &eacute;tudi&eacute;.
Avec la probl&eacute;matique &eacute;clair&eacute;e on passe &agrave;
la phase <B>descriptive</B>, &agrave; l'aide de techniques
<I>d'observation</I> et de <I>communication</I>. Les techniques
d'observation permettent d'enregistrer le comportement d'une mani&egrave;re
inobtrusive. Mais dans la plupart des cas l'information est obtenue
par enqu&ecirc;te sur &eacute;chantillon &agrave; l'aide d'un
questionnaire. Dans cette cat&eacute;gorie on trouve les enqu&ecirc;tes
ponctuelles, les enqu&ecirc;tes omnibus les panels. Par fois
l'<I>exp&eacute;rimentation</I> &agrave; travers l'&eacute;tude
<B>causale</B> est aussi exig&eacute;e. Les tests de concept, les
copy tests, tests de produit, les march&eacute;s test servent &agrave;
accro&radic;&AElig;tre la qualit&eacute; de la d&eacute;cision
manag&eacute;riale. 
</P>
<H2 CLASS="western"><A NAME="La_collecte_des_donn.C3.A9es_et_les_sources_d.27informations"></A>
La collecte des donn&eacute;es et les sources d'informations 
</H2>
<H6 CLASS="western"><A NAME="Information_primaire_et_secondaire"></A>Information
primaire et secondaire 
</H6>
<P>Pour obtenir des informations il y a le choix entre des donn&eacute;es
pr&eacute;existantes (<B>information secondaire</B>) publi&eacute;es
ou non publi&eacute;es, externes ou internes &agrave; l'entreprise
qui sont souvent peu co&ucirc;teuses mais aussi peu adapt&eacute;es
aux objectifs de l'&eacute;tude et des donn&eacute;es recueillies
directement en observant ou en interrogeant les clients (<B>information
primaire</B>). 
</P>
<H6 CLASS="western"><A NAME="Cat.C3.A9gories_de_donn.C3.A9es_secondaires"></A>
Cat&eacute;gories de donn&eacute;es secondaires 
</H6>
<P>Les <I>donn&eacute;es internes</I> sur les ventes, les clients,
les actions marketing pass&eacute;es, les co&ucirc;ts, sur la
distribution et les acheteurs organis&eacute;s souvent en base de
donn&eacute;es, sont des outils redoutables (voir essentiels) pour
cibler la client&egrave;le. Le marketing direct, la vente par
correspondance, le marketing des bases de donn&eacute;es illustrent
la force que peuvent apporter les donn&eacute;es internes &agrave;
une entreprise. 
</P>
<P>Les <I>donn&eacute;es externes</I> sont soit publiques (en libre
acc&egrave;s ou &agrave; des co&ucirc;ts modiques) soit commerciales.
Parmi les donn&eacute;es <I>publiques</I> on trouve des informations
publi&eacute;es ou des informations accessibles on-line dans des
bases de donn&eacute;es sp&eacute;cialis&eacute;es ou (et maintenant
de plus en plus) sur Internet. 
</P>
<P>Les informations <I>commerciales</I> sont offertes par des
services d'informations standardis&eacute;es pour le marketing (des
profils client&egrave;le, mesure des ventes et des parts de march&eacute;,
mesure d'exposition &agrave; des medias et de leur impact et plus
rarement des &eacute;tudes &agrave; la carte). 
</P>
<H2 CLASS="western"><A NAME="Recherche_des_informations_primaires"></A>
Recherche des informations primaires 
</H2>
<H6 CLASS="western"><A NAME="Utiliser_la_connaissance_du_comportement_du_consommateur_comme_guide"></A>
Utiliser la connaissance du comportement du consommateur comme guide 
</H6>
<P>Les mod&egrave;les conceptuels du <I>comportement du consommateur</I>
que ce soit le consommateur individuel ou le consommateur industriel
sont un guide essentiel pour sp&eacute;cifier les informations
n&eacute;cessaires. 
</P>
<P>D'une mani&egrave;re simplifi&eacute;e on suppose que le
consommateur est model&eacute; par des facteurs d'environnement (de
son environnement), que par rapport &agrave; un produit ou service il
est soumis &agrave; un ensemble de stimuli qui viennent de sources
incontr&ocirc;lables par l'entreprise (l'environnement) mais aussi &agrave;
des stimuli g&eacute;n&eacute;r&eacute;s par l'entreprise ou bien par
le produit lui-m&ecirc;me. 
</P>
<H6 CLASS="western"><A NAME="Facteurs"></A>Facteurs 
</H6>
<P>Parmi les <B>facteurs d'environnement</B> qui d&eacute;terminent
le comportement du consommateur on trouve les caract&eacute;ristiques
socio-demographiques (&radic;&cent;ge, sexe, occupation, &eacute;tat
civil, niveau d'&eacute;ducation, classe ou cat&eacute;gorie sociale,
cycle de vie familial) mais aussi les caract&eacute;ristiques
psycho-sociales (personnalit&eacute;, style de vie). Tous ces
&eacute;l&eacute;ments sont importants pour la segmentation du
march&eacute;. 
</P>
<H6 CLASS="western"><A NAME="R.C3.A9ponses_aux_stimuli"></A>R&eacute;ponses
aux stimuli 
</H6>
<P>La <B>r&eacute;action aux stimuli</B> g&eacute;n&eacute;r&eacute;s
par le march&eacute; est progressive, les individus ne deviennent pas
brusquement des acheteurs d'une marque (produit/service), ils
&eacute;voluent en apprenant et traversent plusieurs phases. Il
s'agit d'une &eacute;tape cognitive (information, apprentissage,
connaissance), d'une &eacute;tape affective (ou se forment les
attitudes et les pr&eacute;f&eacute;rences et ou les motivations ont
un r&ocirc;le &agrave; jouer) et &eacute;tape conative ( d'action,
achat). L'ordre de ces &eacute;tapes diff&egrave;re en fonction des
situations d'achat (premier achat, achat r&eacute;p&eacute;t&eacute;,
produit impliquant ou non-impliquant etc.). Pour l'entreprise il est
important de savoir dans quelle phase se trouve le client par rapport
au produit offert, afin de pr&eacute;parer et doser les stimuli &agrave;
administrer et trouver un mix-marketing adapt&eacute; pour faire
avancer les sujets vis&eacute;s vers l'&eacute;tat d'acheteur ou
d'acheteur fid&egrave;le. C'est pour cela que le recueil direct
d'informations aupr&egrave;s de la client&egrave;le devra permettre
de d&eacute;celer progressivement par rapport au produit, le degr&eacute;
de connaissance, les attitudes, les intentions d'achat, les
motivations, les habitudes et comportements d'achat. 
</P>
<H2 CLASS="western"><A NAME="Moyens_de_collecte_d.27informations_primaires"></A>
Moyens de collecte d'informations primaires 
</H2>
<H6 CLASS="western"><A NAME="Observation.2C_enqu.C3.AAte_et_exp.C3.A9rimentation"></A>
Observation, enqu&ecirc;te et exp&eacute;rimentation 
</H6>
<P>Les donn&eacute;es primaires sont obtenues par observation ou par
communication directe. La communication suppose souvent la r&eacute;daction
d'un questionnaire et c'est le seul moyen pour obtenir des
informations sur les attitudes, connaissances, motivations et
intentions. L'observation est plus adapt&eacute;e pour procurer des
donn&eacute;es comportementales. 
</P>
<H6 CLASS="western"><A NAME="Le_questionnaire"></A>Le questionnaire 
</H6>
<P>Le questionnaire est l'instrument le plus fr&eacute;quemment
utilis&eacute; pour le recueil direct des informations. Apr&egrave;s
une r&eacute;daction attentive qui essaye de couvrir tout les
informations &agrave; obtenir, suivi par des phases de pr&eacute;test
et correction, le questionnaire est administr&eacute; (par voie
postale, t&eacute;l&eacute;phone ou t&eacute;l&eacute;matique) &agrave;
un &eacute;chantillon repr&eacute;sentatif de la population cibl&eacute;e.
Les questionnaires remplis sont collect&eacute;s et d&eacute;pouill&eacute;s.
Toutes les r&eacute;ponses sont codifi&eacute;es et enregistr&eacute;es
dans des tableaux de donn&eacute;es (appel&eacute;s parfois
bordereaux de d&eacute;pouillement) o&ugrave; chaque ligne repr&eacute;sente
un questionnaire, comme dans la Figure 2. 
</P>
<H6 CLASS="western"><A NAME=".28a.29_exemple_de_questionnaire_:"></A>(a)
exemple de questionnaire: 
</H6>
<P ALIGN=CENTER><A HREF="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/index.php/File:Question_htm.gif"><FONT COLOR="#000080"><IMG SRC="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/images/1/13/Question_htm.gif" NAME="graphics2" ALT="Question htm.gif" ALIGN=BOTTOM WIDTH=417 HEIGHT=502 BORDER=2></FONT></A>
</P>
<H6 CLASS="western"><A NAME=".28b.29_exemple_de_tableau_de_d.C3.A9pouillement_d.27enqu.C3.AAte"></A>
(b) exemple de tableau de d&eacute;pouillement d'enqu&ecirc;te 
</H6>
<PRE>           001221123442424143122
           <SPAN LANG="fr-FR">002111214311333231322</SPAN>
           <SPAN LANG="fr-FR">003111214414414414342</SPAN>
           <SPAN LANG="fr-FR">.....................................</SPAN>
           <SPAN LANG="fr-FR">599421211232211113421</SPAN></PRE><P ALIGN=CENTER STYLE="margin-top: 0.22cm; margin-bottom: 0.21cm; widows: 2; page-break-before: auto; page-break-after: auto">
<FONT FACE="Arial, sans-serif"><FONT SIZE=2 STYLE="font-size: 10pt"><B>Figure
2. Le questionnaire: pr&eacute;-codage, codage et enregistrement des
r&eacute;ponses </B></FONT></FONT>
</P>
<P>Le questionnaire pr&eacute;sent&eacute; en Figure 2 est un exemple
r&eacute;duit et simplifi&eacute;. Un vrai questionnaire (le cas
CAMIP) est donn&eacute; en annexe ainsi qu'une collection des types
de questions qui tient compte d'un mod&egrave;le hi&eacute;rarchique
du comportement du consommateur. 
</P>
<H6 CLASS="western"><A NAME="La_codification_des_questions"></A>La
codification des questions 
</H6>
<TABLE WIDTH=855 BORDER=0 CELLPADDING=2 CELLSPACING=0>
	<COL WIDTH=282>
	<COL WIDTH=565>
	<TR>
		<TD WIDTH=282>
			<P><B>Type de question </B>
			</P>
		</TD>
		<TD WIDTH=565>
			<P><B>Nombres de colonnes (variables) par question </B>
			</P>
		</TD>
	</TR>
	<TR>
		<TD WIDTH=282>
			<P>N<B>ominales: </B>
			</P>
		</TD>
		<TD WIDTH=565>
			<P> 
			</P>
		</TD>
	</TR>
	<TR>
		<TD WIDTH=282>
			<P>Q. au choix multiple exclusif 
			</P>
		</TD>
		<TD WIDTH=565>
			<P>une 
			</P>
		</TD>
	</TR>
	<TR>
		<TD WIDTH=282>
			<P>Q. au choix multiple non exclusif 
			</P>
		</TD>
		<TD WIDTH=565>
			<P>autant de colonnes que le nombre de modalit&eacute;s (cod&eacute;es
			0 ou 1) 
			</P>
		</TD>
	</TR>
	<TR>
		<TD WIDTH=282>
			<P>Q. ouvertes (autres ...) 
			</P>
		</TD>
		<TD WIDTH=565>
			<P>une et on augmente le nombre de modalit&eacute;s en fonction
			des r&eacute;ponses 
			</P>
		</TD>
	</TR>
	<TR>
		<TD WIDTH=282>
			<P><B>Ordinales </B>
			</P>
		</TD>
		<TD WIDTH=565>
			<P>plusieurs modalit&eacute;s (tant de colonnes que propositions
			possibles) 
			</P>
		</TD>
	</TR>
	<TR>
		<TD WIDTH=282>
			<P><B>Quantitatives</B> 
			</P>
		</TD>
		<TD WIDTH=565>
			<P>une; si &eacute;chelle d'attitude une colonne pour chaque item 
			</P>
		</TD>
	</TR>
</TABLE>
<P ALIGN=CENTER STYLE="margin-top: 0.22cm; margin-bottom: 0.21cm; widows: 2; page-break-before: auto; page-break-after: auto">
<FONT FACE="Arial, sans-serif"><FONT SIZE=2 STYLE="font-size: 10pt"><B><SPAN LANG="fr-FR">Tableau
1 - R&egrave;gles d'enregistrement des r&eacute;ponses aux
questionnaires dans les tableaux de donn&eacute;es d'enqu&ecirc;te</SPAN></B></FONT></FONT></P>
<H6 CLASS="western"><A NAME="Les_questionnairs_en_ligne"></A>Les
questionnaires en ligne 
</H6>
<P>Il est possible d'enregistrer les r&eacute;ponses au questionnaire
directement sur l'ordinateur. Les questionnaires automatis&eacute;s
sur ordinateur ont l'avantage d'&eacute;liminer en grande partie les
fautes de frappe, ils codent et enregistrent les donn&eacute;es
automatiquement dans des tableaux. Un exemple de questionnaire
automatis&eacute; sur tableur est donn&eacute; en annexe. Sur le Web
de l'Internet le m&eacute;canisme des formulaires (Forms) facilite la
saisie des r&eacute;ponses &agrave; l'aide d'objets d'interface
adapt&eacute;s (zones de texte, zone d'entr&eacute;e, cases
d'options, cases &agrave; cocher, listes &agrave; s&eacute;lection
unique ou multiple etc.). Les informations saisies sont capt&eacute;es
sur le serveur de celui qui m&egrave;ne l'enqu&ecirc;te et
enregistr&eacute;es dans une base de donn&eacute;es ou autrement
trait&eacute;es par des programmes adapt&eacute;s, qui profitent d'un
autre standard qui s'est impos&eacute; sur Internet le CGI (Common
Gateway Interface). En profitant des deux standards les Forms et les
CGI il est relativement facile de mener des enqu&ecirc;tes
interactives en temps r&eacute;el et &agrave; distance. Des
informations suppl&eacute;mentaires concernant la pr&eacute;paration
des enqu&ecirc;tes sur Internet se trouvent dans l'annexe. 
</P>
<H2 CLASS="western"><A NAME="Nature_des_informations"></A>Nature des
informations 
</H2>
<H6 CLASS="western"><A NAME="Types_d.27informations"></A>Types
d'informations 
</H6>
<P><B>Informations quantitatives</B> &egrave; r&eacute;sultent de
l'observation des comportements des intervenants sur le march&eacute;,
elles sont relativement objectives et contr&ocirc;lables et r&eacute;pondent
aux questions &quot;combien?&quot; et &quot;comment?&quot; (ex.
notori&eacute;t&eacute; des produits, possession des produits,
quantit&eacute;s achet&eacute;es, fr&eacute;quences d'achat, lieux
d'achat, modes d'information sur les produits etc.) 
</P>
<P><B>Informations qualitatives</B> &egrave; s'int&eacute;ressent aux
facteurs qui d&eacute;terminent les comportements et sont de nature
subjective. Leur recueil et interpr&eacute;tation sont en g&eacute;n&eacute;ral
plus difficiles (ex. les motivations, perceptions, les opinions et
attitudes, les pr&eacute;f&eacute;rences etc.) 
</P>
<H6 CLASS="western"><A NAME="La_mesure"></A>La mesure 
</H6>
<P>En marketing le questionnaire sert aussi comme instrument de
mesure. 
</P>
<P>La <B>mesure</B> est d&eacute;finie: comme &eacute;tant form&eacute;e
de &quot;r&egrave;gles pour attribuer des nombres &agrave; des
objets, de telle sorte qu'elles repr&eacute;sentent des quantit&eacute;s
d'attributs&quot; (1. on mesure des attributs des objets, non pas les
objets eux-m&ecirc;mes; 2. la mani&egrave;re dans laquelle les
nombres sont attribu&eacute;s n'est pas sp&eacute;cifi&eacute;e, les
nombres jouent un r&ocirc;le de symbole, ce ne sont pas les
propri&eacute;t&eacute;s intrins&egrave;ques des nombres, qui sont
prises en compte mais les propri&eacute;t&eacute;s des attributs
qu'ils repr&eacute;sentent). Une autre d&eacute;finition consid&egrave;re
la mesure &quot;comme le moyen d'obtenir des symboles repr&eacute;sentant
les propri&eacute;t&eacute;s des personnes, d'objets, d'&eacute;v&eacute;nements
ou d'&eacute;tats, de telle sorte que ces symboles aient les m&ecirc;mes
relations entre eux que les choses repr&eacute;sent&eacute;es&quot;. 
</P>
<H6 CLASS="western"><A NAME="Les_echelles_de_mesure"></A>Les echelles
de mesure 
</H6>
<P>Les <B>&eacute;chelles nominales</B>: ont comme seule propri&eacute;t&eacute;
<I>l'identit&eacute;</I>, la plus simple des propri&eacute;t&eacute;s
d'une &eacute;chelle de nombres. L'identit&eacute; exprime
l'appartenance des objets &eacute;tudi&eacute;s &agrave; une
cat&eacute;gorie. Elles sont les plus pauvres en informations. 
</P>
<P>Les <B>&eacute;chelles ordinales </B>ont une seconde propri&eacute;t&eacute;
des &eacute;chelles de nombres, l'<I>ordre ,</I> qui est ajout&eacute;
&agrave; la premi&egrave;re<I>. </I>Elles permettent de classer les
objets selon un ordre donn&eacute;. 
</P>
<P>Elles apparaissent dans les mesures de pr&eacute;f&eacute;rences
sous la forme d'&eacute;chelles de classement, comparaison par
paires, tierc&eacute; des pr&eacute;f&eacute;rences etc.. 
</P>
<P>Les <B>&eacute;chelles d'intervalle</B> ajoutent une troisi&egrave;me
propri&eacute;t&eacute; des &eacute;chelles de nombres, le fait que
<I>l'intervalle</I> entre les nombres a un sens, ce qui signifie que
les <I>diff&eacute;rences</I> peuvent &ecirc;tre compar&eacute;es.
(exemple: les &eacute;chelles de temp&eacute;rature Celsius et
Farenheit) 
</P>
<P>Les <B>&eacute;chelles de ratio</B> se diff&eacute;rentient par
rapport aux &eacute;chelles d'intervalle par le fait qu'elles
poss&egrave;dent un <I>z&eacute;ro absolu</I>. 
</P>
<H2 CLASS="western"><A NAME="Le_tableau_de_donn.C3.A9es:_documentation.2C_v.C3.A9rification.2C_transformation_des_donn.C3.A9es."></A>
Le tableau de donn&eacute;es: documentation, v&eacute;rification,
transformation des donn&eacute;es. 
</H2>
<H6 CLASS="western"><A NAME="Organisation_d.27un_tableau_de_d.C3.A9pouillement_d.27enqu.C3.AAte"></A>
Organisation d'un tableau de d&eacute;pouillement d'enqu&ecirc;te 
</H6>
<P>Dans la Figure 3. est pr&eacute;sent&eacute;e une organisation
possible sur tableur des donn&eacute;es collect&eacute;es par
enqu&ecirc;te. 
</P>
<P ALIGN=CENTER><A HREF="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/index.php/File:Image418.gif"><FONT COLOR="#000080"><IMG SRC="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/images/4/40/Image418.gif" NAME="graphics3" ALT="Image418.gif" ALIGN=BOTTOM WIDTH=250 HEIGHT=194 BORDER=2></FONT></A>
</P>
<P ALIGN=CENTER STYLE="margin-top: 0.22cm; margin-bottom: 0.21cm; widows: 2; page-break-before: auto; page-break-after: auto">
<FONT FACE="Arial, sans-serif"><FONT SIZE=2 STYLE="font-size: 10pt"><B>Figure
3. Organisation des donn&eacute;es sur une feuille de calcul (sur
tableur) </B></FONT></FONT>
</P>
<H6 CLASS="western"><A NAME="Variables_et_observations"></A>Variables
et observations 
</H6>
<P>Chaque colonne du tableau repr&eacute;sente une variable (voir par
exemple le tableau de la Figure 2.) . Pour faciliter la s&eacute;lection
des variables pour les &eacute;ventuels traitements, elles doivent
avoir des noms. 
</P>
<P ALIGN=CENTER><A HREF="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/index.php/File:Image419.gif"><FONT COLOR="#000080"><IMG SRC="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/images/b/b6/Image419.gif" NAME="graphics4" ALT="Image419.gif" ALIGN=BOTTOM WIDTH=162 HEIGHT=138 BORDER=2></FONT></A>
</P>
<P ALIGN=CENTER STYLE="margin-top: 0.22cm; margin-bottom: 0.21cm; widows: 2; page-break-before: auto; page-break-after: auto">
<FONT FACE="Arial, sans-serif"><FONT SIZE=2 STYLE="font-size: 10pt"><B>Figure
4. La place et le nom d'une variable dans le tableau de donn&eacute;es
(tableur) </B></FONT></FONT>
</P>
<H2 CLASS="western"><A NAME="Analyses_pr.C3.A9liminaires_des_donn.C3.A9es:_tableaux_de_fr.C3.A9quence_et_statistiques_descriptives"></A>
Analyses pr&eacute;liminaires des donn&eacute;es: tableaux de
fr&eacute;quence et statistiques descriptives 
</H2>
<H6 CLASS="western"><A NAME="Les_traitements_usuels"></A>Les
traitements usuels 
</H6>
<P>Les premiers traitements appliqu&eacute;s aux donn&eacute;es
cherchent &agrave; r&eacute;sumer et &agrave; mettre en &eacute;vidence
les &eacute;ventuelles erreurs et/ou donn&eacute;es aberrantes qui
ont &eacute;chapp&eacute; &agrave; la correction au moment de la
saisie. Il s'agit des statistiques descriptives et de tableaux de
fr&eacute;quence (simples et crois&eacute;s). Une grande partie des
&eacute;tudes marketing (90%) ne vont pas plus loin dans les analyses
pour d&eacute;crire le march&eacute;. 
</P>
<H6 CLASS="western"><A NAME="Tableaux_de_fr.C3.A9quence"></A>Tableaux
de fr&eacute;quence 
</H6>
<P>Les tableaux de fr&eacute;quence montrent le nombre des cas
enregistr&eacute; dans diff&eacute;rents intervalles ou cat&eacute;gories.
Les tableaux de fr&eacute;quences simples (tris &agrave; plat)
comptent les fr&eacute;quences pour une seul variable. Ils sont
souvent represent&eacute; sous forme d'<B>histogrammes</B>. 
</P>
<P ALIGN=CENTER><A HREF="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/index.php/File:Image420.gif"><FONT COLOR="#000080"><IMG SRC="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/images/1/19/Image420.gif" NAME="graphics5" ALT="Image420.gif" ALIGN=BOTTOM WIDTH=258 HEIGHT=138 BORDER=2></FONT></A>
</P>
<P ALIGN=CENTER STYLE="margin-top: 0.22cm; margin-bottom: 0.21cm; widows: 2; page-break-before: auto; page-break-after: auto">
<FONT FACE="Arial, sans-serif"><FONT SIZE=2 STYLE="font-size: 10pt"><B>Figure
5. Le tableau de fr&eacute;quence simple (ou tris &agrave; plat). </B></FONT></FONT>
</P>
<P>Sur tableur il y a la fonction FREQUENCE( nom variable, matrice
d'intervalles) qui le calcule. 
</P>
<P>voil&agrave; comment on calcule sur un tableur la frequence et la
frequence cumul&eacute; des reponses &agrave; la premi&egrave;re
question de la mini-enqu&ecirc;te pr&eacute;sent&eacute; en Figure 2.
</P>
<P><BR><BR>
</P>
<CENTER>
	<TABLE WIDTH=456 BORDER=0 CELLPADDING=2 CELLSPACING=0>
		<COL WIDTH=19>
		<COL WIDTH=95>
		<COL WIDTH=64>
		<COL WIDTH=53>
		<COL WIDTH=94>
		<COL WIDTH=107>
		<TR>
			<TD WIDTH=19 BGCOLOR="#00ffff">
				<P> 
				</P>
			</TD>
			<TD WIDTH=95 BGCOLOR="#00ffff">
				<P>D 
				</P>
			</TD>
			<TD WIDTH=64 BGCOLOR="#00ffff">
				<P>E 
				</P>
			</TD>
			<TD WIDTH=53 BGCOLOR="#00ffff">
				<P>F 
				</P>
			</TD>
			<TD WIDTH=94 BGCOLOR="#00ffff">
				<P>G 
				</P>
			</TD>
			<TD WIDTH=107 BGCOLOR="#00ffff">
				<P>H 
				</P>
			</TD>
		</TR>
		<TR>
			<TD WIDTH=19 BGCOLOR="#00ffff">
				<P>1 
				</P>
			</TD>
			<TD WIDTH=95>
				<P><BR>
				</P>
			</TD>
			<TD WIDTH=64>
				<P>Interv. 
				</P>
			</TD>
			<TD WIDTH=53>
				<P>Freq. 
				</P>
			</TD>
			<TD WIDTH=94>
				<P>Freq.Cum 
				</P>
			</TD>
			<TD WIDTH=107>
				<P>&lt;--Formule 
				</P>
			</TD>
		</TR>
		<TR>
			<TD WIDTH=19 BGCOLOR="#00ffff">
				<P>2 
				</P>
			</TD>
			<TD WIDTH=95>
				<P>Marque A 
				</P>
			</TD>
			<TD WIDTH=64>
				<P>1 
				</P>
			</TD>
			<TD WIDTH=53>
				<P>3 
				</P>
			</TD>
			<TD WIDTH=94>
				<P>3 
				</P>
			</TD>
			<TD WIDTH=107>
				<P>=F3 
				</P>
			</TD>
		</TR>
		<TR>
			<TD WIDTH=19 BGCOLOR="#00ffff">
				<P>3 
				</P>
			</TD>
			<TD WIDTH=95>
				<P>Marque B 
				</P>
			</TD>
			<TD WIDTH=64>
				<P>2 
				</P>
			</TD>
			<TD WIDTH=53>
				<P>4 
				</P>
			</TD>
			<TD WIDTH=94>
				<P>7 
				</P>
			</TD>
			<TD WIDTH=107>
				<P>=G3+F4 
				</P>
			</TD>
		</TR>
		<TR>
			<TD WIDTH=19 BGCOLOR="#00ffff">
				<P>4 
				</P>
			</TD>
			<TD WIDTH=95>
				<P>Marque C 
				</P>
			</TD>
			<TD WIDTH=64>
				<P>3 
				</P>
			</TD>
			<TD WIDTH=53>
				<P>7 
				</P>
			</TD>
			<TD WIDTH=94>
				<P>14 
				</P>
			</TD>
			<TD WIDTH=107>
				<P>.. 
				</P>
			</TD>
		</TR>
		<TR>
			<TD WIDTH=19 BGCOLOR="#00ffff">
				<P>5 
				</P>
			</TD>
			<TD WIDTH=95>
				<P>Marque D 
				</P>
			</TD>
			<TD WIDTH=64>
				<P>4 
				</P>
			</TD>
			<TD WIDTH=53>
				<P>2 
				</P>
			</TD>
			<TD WIDTH=94>
				<P>16 
				</P>
			</TD>
			<TD WIDTH=107>
				<P>.. 
				</P>
			</TD>
		</TR>
	</TABLE>
</CENTER>
<P ALIGN=CENTER STYLE="margin-top: 0.22cm; margin-bottom: 0.21cm; widows: 2; page-break-before: auto; page-break-after: auto">
<FONT FACE="Arial, sans-serif"><FONT SIZE=2 STYLE="font-size: 10pt"><B>Tableau
4 - Calcul de la distribution et r&eacute;partition de fr&eacute;quence
sur tableur </B></FONT></FONT>
</P>
<H6 CLASS="western"><A NAME="Anatomie_d.27une_distribution_de_fr.C3.A9quence"></A>
Anatomie d'une distribution de fr&eacute;quence 
</H6>
<P>A partir de la distribution de fr&eacute;quence et la r&eacute;partition
des fr&eacute;quences (ou la fr&eacute;quence cumul&eacute;e) on
calcule un grand nombre de statistiques descriptives. La Figure 6.
montre graphiquement comment des statistiques comme la moyenne, la
m&eacute;diane, les quartiles sont d&eacute;duites a partir d'une
distribution de fr&eacute;quence. Elle montre aussi quel est
l'int&eacute;r&ecirc;t d'utiliser la fr&eacute;quence cumul&eacute;e
pour identifier certaines de ces mesures. Pour mieux reconna&radic;&AElig;tre
l'allure de la distribution de fr&eacute;quence empirique on trace
sur l'histogramme le <B>polygone de fr&eacute;quence</B> en
r&eacute;unissant les points qui se trouvent au milieux sur le cot&eacute;
haut des barres. 
</P>
<P ALIGN=CENTER STYLE="margin-bottom: 0cm"><A HREF="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/index.php/File:Image421.gif"><FONT COLOR="#000080"><IMG SRC="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/images/b/b8/Image421.gif" NAME="graphics6" ALT="Image421.gif" ALIGN=BOTTOM WIDTH=307 HEIGHT=235 BORDER=2></FONT></A>(a)</P>
<P ALIGN=CENTER><A HREF="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/index.php/File:Image422.gif"><FONT COLOR="#000080"><IMG SRC="http://claree.univ-lille1.fr/%7Ecalciu/wiki_poscce212/images/f/f2/Image422.gif" NAME="graphics7" ALT="Image422.gif" ALIGN=BOTTOM WIDTH=274 HEIGHT=214 BORDER=2></FONT></A>(b)</P>
<P ALIGN=CENTER STYLE="margin-top: 0.22cm; margin-bottom: 0.21cm; widows: 2; page-break-before: auto; page-break-after: auto">
<FONT FACE="Arial, sans-serif"><FONT SIZE=2 STYLE="font-size: 10pt"><B>Figure
6. Anatomie d'une distribution de fr&eacute;quence (a) et d'une
r&eacute;partition de fr&eacute;quence (b) . Le lien entre un
histogramme et un box plot </B></FONT></FONT>
</P>
<H6 CLASS="western"><A NAME="Les_tableaux_crois.C3.A9s"></A>Les
tableaux crois&eacute;s 
</H6>
<P>Les tableaux crois&eacute;s (tris crois&eacute;s) comptent la
fr&eacute;quence des cas ayant de caract&eacute;ristiques
(intervalles) communes sur deux ou plusieurs variables. Ils r&eacute;sument
l'information contenue dans les variables juxtapos&eacute;s et
permettent d'analyser l'association et les liens entre les variables.
Les tableaux crois&eacute;s de deux variables seront trait&eacute;s
au chapitre sur les analyses bi-vari&eacute;s et les tableaux crois&eacute;s
multiples appara&icirc;tront dans les chapitres qui portent sur
l'analyse de donn&eacute;es multidimensionnelle. 
</P>
<P STYLE="margin-bottom: 0cm"><BR>
</P>
</BODY>
</HTML>